/*
为迎接开学，某文具店提出如下优惠销售方案，用switch编写一个程序，输入商品原价格，输出实付价格：
0<总价<50元，商品0.95折；
50≤总价<100元，商品0.9折；
100≤总价<150元，商品0.85折；
150≤总价<200元，商品0.8折； 
总价≥200元，商品0.75折 
【注意】输入和输出各占一行，运行效果应如下所示（第1行为输入，第2行为输出），格式错误算结果错误,结果保留小数后两位。
138
117.30
*/
#include <stdio.h>
int main() {
    float price1 = 0;
    scanf("%f", &price1); 
    switch ((int)(price1 / 50)) {
        case 0: // 0 < 总价 < 50
            price1 *= 0.95;
            break;
        case 1: // 50 ≤ 总价 < 100
            price1 *= 0.90;
            break;
        case 2: // 100 ≤ 总价 < 150
            price1 *= 0.85;
            break;
        case 3: // 150 ≤ 总价 < 200
            price1 *= 0.80;
            break;
        default: // 总价 ≥ 200
            price1 *= 0.75;
            break;
    }
    printf("%.2f\n", price1); 
    return 0;
}
